app/Models/Model_registro.php

    public function getlistteachersjson($parentsID = null)
    {
        $builder = $this->db1->table('cprueba c');
        $builder->select('c.*');
        $builder->orderBy('c.ID', 'DESC');
        if ($parentsID != null) {
            $builder->where(['c.ID' => $parentsID]); //esta condicion where toma como un string plano es decir columan = valor
            //$builder->where('p.parentsID', $parentsID); //esta condicion where toma como un string idependientes columan, valor
        }
        $query = $builder->get();
---
SELECT `c`.*
FROM `cprueba` `c`
ORDER BY `c`.`ID` DESC